app/public/soap/soap.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:tns="urn:Orders" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://schemas.xmlsoap.org/wsdl/" name="Orders" targetNamespace="urn:Orders"><wsdl:types><xsd:schema targetNamespace="urn:Orders"><xsd:element name="order"><xsd:complexType><xsd:sequence><xsd:element name="hash" type="xsd:string"/><xsd:element name="userId" type="xsd:integer" nillable="true"/><xsd:element name="token" type="xsd:string"/><xsd:element name="number" type="xsd:string" nillable="true"/><xsd:element name="status" type="xsd:integer"/><xsd:element name="email" type="xsd:string" nillable="true"/><xsd:element name="vatType" type="xsd:integer"/><xsd:element name="vatNumber" type="xsd:string" nillable="true"/><xsd:element name="taxNumber" type="xsd:string" nillable="true"/><xsd:element name="discount" type="xsd:short" nillable="true"/><xsd:element name="delivery" type="xsd:float" nillable="true"/><xsd:element name="deliveryType" type="xsd:integer" nillable="true"/><xsd:element name="deliveryTimeMin" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryTimeMax" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryTimeConfirmMin" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryTimeConfirmMax" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryTimeFastPayMin" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryTimeFastPayMax" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryOldTimeMin" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryOldTimeMax" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryIndex" type="xsd:string" nillable="true"/><xsd:element name="companyName" type="xsd:string" nillable="true"/><xsd:element name="payType" type="xsd:short"/><xsd:element name="payDateExecution" type="xsd:dateTime" nillable="true"/><xsd:element name="offsetDate" type="xsd:dateTime" nillable="true"/><xsd:element name="offsetReason" type="xsd:short" nillable="true"/><xsd:element name="proposedDate" type="xsd:dateTime" nillable="true"/><xsd:element name="shipDate" type="xsd:dateTime" nillable="true"/><xsd:element name="trackingNumber" type="xsd:string" nillable="true"/><xsd:element name="locale" type="xsd:string"/><xsd:element name="curRate" type="xsd:float" nillable="true"/><xsd:element name="currency" type="xsd:string"/><xsd:element name="measure" type="xsd:string"/><xsd:element name="name" type="xsd:string"/><xsd:element name="description" type="xsd:string" nillable="true"/><xsd:element name="createDate" type="xsd:dateTime"/><xsd:element name="updateDate" type="xsd:dateTime" nillable="true"/><xsd:element name="step" type="xsd:integer"/><xsd:element name="addressEqual" type="xsd:integer" nillable="true"/><xsd:element name="bankTransferRequested" type="xsd:integer" nillable="true"/><xsd:element name="acceptPay" type="xsd:integer" nillable="true"/><xsd:element name="cancelDate" type="xsd:dateTime" nillable="true"/><xsd:element name="weightGross" type="xsd:float" nillable="true"/><xsd:element name="productReview" type="xsd:integer" nillable="true"/><xsd:element name="mirror" type="xsd:short" nillable="true"/><xsd:element name="process" type="xsd:integer" nillable="true"/><xsd:element name="factDate" type="xsd:dateTime" nillable="true"/><xsd:element name="entranceReview" type="xsd:short" nillable="true"/><xsd:element name="paymentEuro" type="xsd:integer" nillable="true"/><xsd:element name="specPrice" type="xsd:integer" nillable="true"/><xsd:element name="showMsg" type="xsd:integer" nillable="true"/><xsd:element name="deliveryPriceEuro" type="xsd:float" nillable="true"/><xsd:element name="addressPayer" type="xsd:integer" nillable="true"/><xsd:element name="sendingDate" type="xsd:dateTime" nillable="true"/><xsd:element name="deliveryCalculateType" type="xsd:integer" nillable="true"/><xsd:element name="fullPaymentDate" type="xsd:dateTime" nillable="true"/><xsd:element name="bankDetails" type="xsd:string" nillable="true"/><xsd:element name="manager" type="tns:Managers"/><xsd:element name="client" type="tns:Clients"/><xsd:element name="carrier" type="tns:Carriers"/><xsd:element name="warehouse" type="tns:Warehouses"/><xsd:element name="deliveryAddr" type="tns:Addresses"/><xsd:element name="bilingAddr" type="tns:Addresses"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="orderwsdlResponse"><xsd:annotation><xsd:documentation>Response: Error or Success</xsd:documentation></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="result" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element><xsd:complexType name="Managers"><xsd:sequence><xsd:element name="managerName" type="xsd:string" nillable="true"/><xsd:element name="managerEmail" type="xsd:string" nillable="true"/><xsd:element name="managerPhone" type="xsd:string" nillable="true"/></xsd:sequence></xsd:complexType><xsd:complexType name="Clients"><xsd:sequence><xsd:element name="sex" type="xsd:short" nillable="true"/><xsd:element name="clientName" type="xsd:string" nillable="true"/><xsd:element name="clientSurname" type="xsd:string" nillable="true"/><xsd:element name="email" type="xsd:string" nillable="true"/></xsd:sequence></xsd:complexType><xsd:complexType name="Carriers"><xsd:sequence><xsd:element name="carrierName" type="xsd:string" nillable="true"/><xsd:element name="carrierContactData" type="xsd:string" nillable="true"/></xsd:sequence></xsd:complexType><xsd:complexType name="Warehouses"><xsd:sequence><xsd:element name="warehouseData" type="xsd:string" nillable="true"/></xsd:sequence></xsd:complexType><xsd:complexType name="Addresses"><xsd:sequence><xsd:element name="countryId" type="xsd:integer" nillable="true"/><xsd:element name="region" type="xsd:string" nillable="true"/><xsd:element name="city" type="xsd:string" nillable="true"/><xsd:element name="address" type="xsd:string" nillable="true"/><xsd:element name="building" type="xsd:string" nillable="true"/><xsd:element name="phoneCode" type="xsd:string" nillable="true"/><xsd:element name="phone" type="xsd:string" nillable="true"/><xsd:element name="apartmentOffice" type="xsd:string" nillable="true"/></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="OrderRequest"><wsdl:part element="tns:order" name="parameters"/></wsdl:message><wsdl:message name="OrderResponse"><wsdl:part type="xsd:string" name="result"/></wsdl:message><wsdl:portType name="OrderPort"><wsdl:operation name="order"><wsdl:input message="tns:OrderRequest"/><wsdl:output message="tns:OrderResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="OrderBinding" type="tns:OrderPort"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="order"><soap:operation soapAction="urn:OrderAction"/><wsdl:input><soap:body use="literal" namespace="urn:Orders" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="urn:Orders" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="WSDLService"><wsdl:port name="OrderPort" binding="tns:OrderBinding"><soap:address location="http://127.0.0.1:8080/soap/orders"/></wsdl:port></wsdl:service></wsdl:definitions>
