request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Orders" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:order soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <urn:order>
                <hash>?</hash>
                <userId>1</userId>
                <token>?</token>
                <number>?</number>
                <status>10</status>
                <email>?</email>
                <vatType>1</vatType>
                <vatNumber>?</vatNumber>
                <taxNumber>?</taxNumber>
                <discount>1</discount>
                <delivery>1</delivery>
                <deliveryType>1</deliveryType>
                <deliveryTimeMin>2002-09-24T00:00:00</deliveryTimeMin>
                <deliveryTimeMax>2002-09-24T00:00:00</deliveryTimeMax>
                <deliveryTimeConfirmMin>2002-09-24T00:00:00</deliveryTimeConfirmMin>
                <deliveryTimeConfirmMax>2002-09-24T00:00:00</deliveryTimeConfirmMax>
                <deliveryTimeFastPayMin>2002-09-24T00:00:00</deliveryTimeFastPayMin>
                <deliveryTimeFastPayMax>2002-09-24T00:00:00</deliveryTimeFastPayMax>
                <deliveryOldTimeMin>2002-09-24T00:00:00</deliveryOldTimeMin>
                <deliveryOldTimeMax>2002-09-24T00:00:00</deliveryOldTimeMax>
                <deliveryIndex>123</deliveryIndex>
                <companyName>?</companyName>
                <payType>1</payType>
                <payDateExecution>2002-09-24T00:00:00</payDateExecution>
                <offsetDate>2002-09-24T00:00:00</offsetDate>
                <offsetReason>1</offsetReason>
                <proposedDate>2002-09-24T00:00:00</proposedDate>
                <shipDate>2002-09-24T00:00:00</shipDate>
                <trackingNumber>?</trackingNumber>
                <locale>?</locale>
                <curRate>1</curRate>
                <currency>?</currency>
                <measure>?</measure>
                <name>?</name>
                <description>?</description>
                <createDate>2002-09-24T00:00:00</createDate>
                <updateDate>2002-09-24T00:00:00</updateDate>
                <step>1</step>
                <addressEqual>0</addressEqual>
                <bankTransferRequested>1</bankTransferRequested>
                <acceptPay>1</acceptPay>
                <cancelDate>2002-09-24T00:00:00</cancelDate>
                <weightGross>1</weightGross>
                <productReview>1</productReview>
                <mirror>1</mirror>
                <process>1</process>
                <factDate>2002-09-24T00:00:00</factDate>
                <entranceReview>1</entranceReview>
                <paymentEuro>1</paymentEuro>
                <specPrice>1</specPrice>
                <showMsg>1</showMsg>
                <deliveryPriceEuro>1</deliveryPriceEuro>
                <addressPayer>1</addressPayer>
                <sendingDate>2002-09-24T00:00:00</sendingDate>
                <deliveryCalculateType>1</deliveryCalculateType>
                <fullPaymentDate>2002-09-24T00:00:00</fullPaymentDate>
                <bankDetails>?</bankDetails>
                <manager>
                    <managerName/>
                    <managerEmail/>
                    <managerPhone/>
                </manager>
                <client>
                    <sex>1</sex>
                    <clientName>?</clientName>
                    <clientSurname>?</clientSurname>
                    <email>?</email>
                </client>
                <carrier>
                    <carrierName>?</carrierName>
                    <carrierContactData>?</carrierContactData>
                </carrier>
                <warehouse>
                    <warehouseData>?</warehouseData>
                </warehouse>
                <deliveryAddr>
                    <countryId>1</countryId>
                    <region>?</region>
                    <city>Вроцлав</city>
                    <address>?</address>
                    <building>?</building>
                    <phoneCode>?</phoneCode>
                    <phone>?</phone>
                    <apartmentOffice>?</apartmentOffice>
                </deliveryAddr>
                <bilingAddr>
                    <countryId>1</countryId>
                    <region>?</region>
                    <city>?</city>
                    <address>?</address>
                    <building>?</building>
                    <phoneCode>?</phoneCode>
                    <phone>?</phone>
                    <apartmentOffice>?</apartmentOffice>
                </bilingAddr>
            </urn:order>
        </urn:order>
    </soapenv:Body>
</soapenv:Envelope>
